package ir.anishehparsi.tu5eve.VariantsModel

data class SiemensModel(
    val title: String,
    val description: String,
    val gearboxType: String,
    val productType: String,
    val technicalNumber: String,
    val engineType: String,
    val throttleType: String,
    val oldCode: String,
    val newCode: String,
    val customerSite: String,
    val electricalType: String,

    val oxygenSensor: String,
    val knockSensor: String,
    val throttle: String,
    val wob: String,
    val wib: String,
    val tmapSensor: String,
    val manifold: String,
    val injector: String,
    val underCover: String,
    val flywheel: String,
    val sparkPlugProtector: String,
    val airCamshaftSeal: String,
    val exhaustCamshaftSeal: String,
    val waterPump: String,
    val airCamshaft: String,
    val exhaustCamshaft: String,
    val engineHandel: String,
    val diskPlate: String,
    val positionSensor: String,
    val crankShaft: String,
    val valveSpring: String,
    val cylinderHead: String,
    val cylinder: String,
    val tHydraulic: String,
    val airCamshaftGear: String,
    val exhaustCamshaftGear: String,
    val crankshaftGear: String,
    val oilPump: String,
    val oilPumpCasing: String,
    val connectingRodPiston: String,
    val coil: String,
)
val variantInboxSiemens: List<SiemensModel>
    get() = listOf(
        SiemensModel(
            "RBH",
            "موتور TU5 کروز تراتل برقی",
            "دستی",
            "رانا زیمنس",
            "IK00668780",
            "TU5",
            "برقی",
            "172B",
            "172B",
            "تهران - مونتاژ 4",
            "SIEMENS",

            "YG20247519",
            "K911841948",
            "IK00252580",
            "YG22249858(مشکی)\nYG20246695",
            "IK00255980",
            "K911842048",
            "YG20247503",
            "IK00095780",
            "9637026580",
            "YG23249819",
            "9683472980",
            "9651177380",
            "9651177380",
            "9635710580",
            "9636452980",
            "9636457380",
            "YG22249851",
            "YG20293540\nYG20297540",
            "---",
            "9641930780",
            "9635454580",
            "9656359280",
            "YG20247513",
            "9635323080\nYG20246672\nYG20246650",
            "9643414980",
            "9643414880",
            "9655547680",
            "9652619580",
            "9621113980",
            "YG20246681",
            "YG20249942"

        ),
        SiemensModel(
            "RBK",
            "موتور TU5 کروز تراتل برقی",
            "دستی",
            "207 زیمنس",
            "IK00771080",
            "TU5",
            "برقی",
            "178B",
            "172B",
            "تهران - مونتاژ 4",
            "SIEMENS",

            "YG20247519",
            "K911841948",
            "IK00252580",
            "YG22249858(مشکی)\n" +
                    "YG20246695",
            "YG20249911\n" +
                    "YG22245042",
            "K911842048",
            "YG20247503",
            "IK00095780",
            "9637026580",
            "YG23249819",
            "9683472980",
            "9651177380",
            "9651177380",
            "9635710580",
            "9636452980",
            "9636457380",
            "YG22249851",
            "YG20293540\n" +
                    "YG20297540",
            "---",
            "9641930780",
            "9635454580",
            "9656359280",
            "YG20247513",
            "9635323080\n" +
                    "YG20246672\n" +
                    "YG20246650",
            "9643414980",
            "9643414880",
            "9655547680",
            "9652619580",
            "9621113980",
            "YG20246681",
            "YG20249942"

        ),
        SiemensModel(
            "RAP",
            "موتور TU5P گیربکس اتوماتیک",
            "اتوماتیک",
            "207 اتوماتیک",
            "IK00878480",
            "TU5P",
            "برقی",
            "185B",
            "185B",
            "تهران - مونتاژ 4",
            "SIEMENS",

            "YG20247519",
            "K911841948",
            "IK00252580",
            "YG22245048(مشکی)\n" +
                    "YG20246695",
            "YG20249911\n" +
                    "YG22245042",
            "K911842048",
            "YG20247503",
            "IK00095780",
            "9674212280",
            "YG22245047 (درایوپلیت)",
            "YG22249823\n" +
                    "9678202080",
            "YG22249831",
            "9651177380",
            "9824998180",
            "YG22249830\n" +
                    "9676515780",
            "YG22249832\n" +
                    "9674614480",
            "9676118680",
            "",
            "YG22249847",
            "9810083080",
            "YG22249835",
            "YG22249816\n" +
                    "9676516480",
            "9810523680",
            "YG22249836\n" +
                    "9636956980",
            "K914561458A\n" +
                    "IK00600032\n" +
                    "9674461480",
            "9643414880",
            "YG22249829\n" +
                    "9674617680",
            "YG22249837\n" +
                    "9674199380",
            "9639840480\n" +
                    "9648492180",
            "YG20246720",
            "YG22249845"

        ),
        SiemensModel(
            "REE",
            "موتور TU5P کروز",
            "دستی",
            "TU5P",
            "IK01472980",
            "TU5P",
            "برقی",
            "188B",
            "188B",
            "تهران - مونتاژ 4",
            "SIEMENS",

            "YG20247519",
            "K911841948",
            "IK00252580",
            "YG22245048(مشکی)\n" +
                    "YG20246695",
            "YG20249911\n" +
                    "YG22245042",
            "K911842048",
            "YG20247503",
            "IK00095780",
            "9674212280",
            "YG23249819",
            "YG22249823\n" +
                    "9678202080",
            "YG22249831",
            "9651177380",
            "9824998180",
            "YG22249830\n" +
                    "9676515780",
            "YG22249832\n" +
                    "9674614480",
            "YG22249851",
            "YG20293540",
            "YG22249847",
            "9641930780",
            "YG22249835",
            "YG22249816\n" +
                    "9676516480",
            "YG22249807\n" +
                    "9677062180",
            "YG22249836\n" +
                    "9636956980",
            "K914561458A\n" +
                    "IK00600032\n" +
                    "9674461480",
            "9643414880",
            "YG22249829\n" +
                    "9674617680",
            "YG22249837\n" +
                    "9674199380",
            "9639840480\n" +
                    "9648492180",
            "YG20246720",
            "YG22249845"

        ),
        SiemensModel(
            "RSS",
            "موتور TU5P کروز صادراتی",
            "دستی",
            "رانا صادراتی",
            "YG22245080",
            "TU5P",
            "برقی",
            "188B",
            "188B",
            "تهران - مونتاژ 4",
            "SIEMENS",

            "YG20247519",
            "K911841948",
            "IK00252580",
            "YG22245048(مشکی)\n" +
                    "YG20246695",
            "IK00255980",
            "K911842048",
            "YG20247503",
            "IK00095780",
            "9674212280",
            "YG23249819",
            "YG22249823\n" +
                    "9678202080",
            "YG22249831",
            "9651177380",
            "9824998180",
            "YG22249830\n" +
                    "9676515780",
            "YG22249832\n" +
                    "9674614480",
            "YG22249851",
            "YG20293540",
            "YG22249847",
            "9641930780",
            "YG22249835",
            "YG22249816\n" +
                    "9676516480",
            "YG22249807\n" +
                    "9677062180",
            "YG22249836\n" +
                    "9636956980",
            "K914561458A\n" +
                    "IK00600032\n" +
                    "9674461480",
            "9643414880",
            "YG22249829\n" +
                    "9674617680",
            "YG22249837\n" +
                    "9674199380",
            "9639840480\n" +
                    "9648492180",
            "YG20246720",
            "YG22249845"

        ),
        SiemensModel(
            "REA",
            "موتور TU5P گیربکس نیمه اتوماتیک 6 سرعته",
            "نیم اتوماتیک",
            "رانا 6 سرعته با گیربکس AMT",
            "IK01612680",
            "TU5P",
            "برقی",
            "188B",
            "188B",
            "تهران - مونتاژ 4",
            "SIEMENS",

            "YG20247519",
            "K911841948",
            "IK00252580",
            "YG22245048(مشکی)\nYG20246695",
            "IK00255980",
            "K911842048",
            "YG20247503",
            "IK00095780",
            "9674212280",
            "YG23249819",
            "YG22249823\n" +
                    "9678202080",
            "YG22249831",
            "9651177380",
            "9824998180",
            "YG22249830\n" +
                    "9676515780",
            "YG22249832\n" +
                    "9674614480",
            "YG22249851",
            "YG20293540\nYG20247534",
            "YG22249847",
            "9641930780",
            "YG22249835",
            "YG22249816\n" +
                    "9676516480",
            "YG22249807\n" +
                    "9677062180",
            "YG22249836\n" +
                    "9636956980",
            "K914561458A\n" +
                    "IK00600032\n" +
                    "9674461480",
            "9643414880",
            "YG22249829\n" +
                    "9674617680",
            "YG22249837\n" +
                    "9674199380",
            "9639840480\n" +
                    "9648492180",
            "YG20246720",
            "YG22249845"

        )
    )