package ir.anishehparsi.tu5eve.VariantsModel

data class SsatModel(
    val title: String,
    val description: String,
    val gearboxType: String,
    val productType: String,
    val technicalNumber: String,
    val engineType: String,
    val throttleType: String,
    val oldCode: String,
    val newCode: String,
    val customerSite: String,
    val electricalType: String,

    val oxygenSensor: String,
    val knockSensor: String,
    val throttle: String,
    val wob: String,
    val wib: String,
    val tmapSensor: String,
    val manifold: String,
    val injector: String,
    val underCover: String,
    val flywheel: String,
    val sparkPlugProtector: String,
    val airCamshaftSeal: String,
    val exhaustCamshaftSeal: String,
    val waterPump: String,
    val airCamshaft: String,
    val exhaustCamshaft: String,
    val engineHandel: String,
    val diskPlate: String,
    val positionSensor: String,
    val crankShaft: String,
    val valveSpring: String,
    val cylinderHead: String,
    val cylinder: String,
    val tHydraulic: String,
    val airCamshaftGear: String,
    val exhaustCamshaftGear: String,
    val crankshaftGear: String,
    val oilPump: String,
    val oilPumpCasing: String,
    val connectingRodPiston: String,
    val coil: String,
)
val variantInboxSsat = listOf(
    SsatModel(
        "SMB",
        "موتور TU5",
        "دستی",
        "207 SSAT",
        "IK01253780",
        "TU5",
        "برقی",
        "166B",
        "172B",
        "تهران - مونتاژ 4",
        "SSAT",

        "9635978280",
        "K911841948",
        "YG23249875",
        "YG22249858 (فشنگی آب سبز)\n" +
                " 9636777180",
        "YG20249911\n" +
                "YG22245042",
        "YG20249984",
        "9635885080",
        "9638220380",
        "9637026580",
        "YG23249819",
        "9683472980",
        "9651177380",
        "9651177380",
        "9635710580",
        "9636452980",
        "9636457380",
        "",
        "YG20293540\n" +
                "YG20297540",
        "---",
        "9641930780",
        "9635454580",
        "9656359280",
        "YG20247513",
        "9635323080\n" +
                "YG20246672\n" +
                "YG20246650",
        "9643414980",
        "9643414880",
        "9655547680",
        "9652619580",
        "9621113980",
        "YG20246681",
        "YG20247497\nYG22245077\n9664400780"

    ),
    SsatModel(
        "SAC",
        "موتور TU5P اتوماتیک",
        "اتوماتیک",
        "تارا اتوماتیک",
        "IK01404480",
        "TU5P",
        "برقی",
        "187B",
        "187B",
        "تهران - مونتاژ 1",
        "SSAT",

        "9635978280",
        "9645311480",
        "YG23249875",
        "YG22245048(سبز)\n" +
                "9636777180",
        "YG20249911\nYG22245042",
        "9639381480",
        "9635885080",
        "K914561008A",
        "9674212280",
        "YG22245047 (درایوپلیت)",
        "YG22249823\n" +
                "9678202080",
        "YG22249831",
        "9651177380",
        "9824998180",
        "YG22249830\n" +
                "9676515780",
        "YG22249832\n" +
                "9674614480",
        "9676118680",
        "",
        "YG23249898",
        "9810083080",
        "YG22249835",
        "YG22249816\n9676516480",
        "9810523680",
        "YG22249836\n9636956980",
        "K914561458A\n" +
                "IK00600032\n" +
                "9674461480",
        "9643414880",
        "YG22249829\n" +
                "9674617680",
        "YG22249837\n9674199380",
        "9639840480\n9648492180",
        "YG20246720",
        "YG23249897\nYG23249907"

    ),
    SsatModel(
        "SAS",
        "موتور TU5P اتوماتیک صادراتی",
        "اتوماتیک",
        "تارا صادراتی اتوماتیک ",
        "YG22245082",
        "TU5P",
        "برقی",
        "187B",
        "187B",
        "تهران - مونتاژ 1",
        "SSAT",

        "9635978280",
        "9645311480",
        "YG23249875",
        "YG22245048(سبز)\n" +
                "9636777180",
        "YG20249911\n" +
                "YG22245042",
        "9639381480",
        "9635885080",
        "K914561008A",
        "9674212280",
        "YG22245047 (درایوپلیت)",
        "YG22249823\n" +
                "9678202080",
        "YG22249831",
        "9651177380",
        "9824998180",
        "YG22249830\n" +
                "9676515780",
        "YG22249832\n" +
                "9674614480",
        "9676118680",
        "",
        "YG23249898",
        "9810083080",
        "YG22249835",
        "YG22249816\n" +
                "9676516480",
        "9810523680",
        "YG22249836\n" +
                "9636956980",
        "K914561458A\n" +
                "IK00600032\n" +
                "9674461480",
        "9643414880",
        "YG22249829\n" +
                "9674617680",
        "YG22249837\n" +
                "9674199380",
        "9639840480\n" +
                "9648492180",
        "YG20246720",
        "YG23249897\n" +
                "YG23249907"

    ),
    SsatModel(
        "SEA",
        "موتور TU5P",
        "دستی",
        "تارا دستی",
        "IK01265180",
        "TU5P",
        "برقی",
        "187B",
        "187B",
        "تهران - مونتاژ 1",
        "SSAT",

        "9635978280",
        "9645311480",
        "YG23249875",
        "YG22245048(سبز)\n9636777180",
        "YG20249911\n" +
                "YG22245042",
        "9639381480",
        "9635885080",
        "K914561008A",
        "9674212280",
        "YG23249819",
        "YG22249823\n" +
                "9678202080",
        "YG22249831",
        "9651177380",
        "9824998180",
        "YG22249830\n" +
                "9676515780",
        "YG22249832\n" +
                "9674614480",
        "9676118680",
        "YG20293540",
        "YG23249898",
        "9641930780",
        "YG22249835",
        "YG22249816\n" +
                "9676516480",
        "YG22249807\n" +
                "9677062180",
        "YG22249836\n" +
                "9636956980",
        "K914561458A\n" +
                "IK00600032\n" +
                "9674461480",
        "9643414880",
        "YG22249829\n" +
                "9674617680",
        "YG22249837\n" +
                "9674199380",
        "9639840480\n" +
                "9648492180",
        "YG20246720",
        "YG23249897\n" +
                "YG23249907"

    ),
    SsatModel(
        "SEB",
        "موتور TU5P گیربکس MT6 با S2",
        "دستی",
        "سازه پویش MT6 S2",
        "IK01825780",
        "TU5P",
        "برقی",
        "187B",
        "188B",
        "تهران - مونتاژ 1",
        "SSAT",

        "9635978280",
        "9645311480",
        "YG23249875",
        "YG22245048(سبز)\n" +
                "9636777180",
        "YG20249911\n" +
                "YG22245042",
        "9639381480",
        "9635885080",
        "K914561008A",
        "9674212280",
        "YG23249819",
        "YG22249823\n" +
                "9678202080",
        "YG22249831",
        "9651177380",
        "9824998180",
        "YG22249830\n" +
                "9676515780",
        "YG22249832\n" +
                "9674614480",
        "YG22249851",
        "YG20293540",
        "IK60121480",
        "9641930780",
        "YG22249835",
        "YG22249816\n" +
                "9676516480",
        "YG22249807\n" +
                "9677062180",
        "YG22249836\n" +
                "9636956980",
        "K914561458A\n" +
                "IK00600032\n" +
                "9674461480",
        "9643414880",
        "YG22249829\n" +
                "9674617680",
        "YG22249837\n" +
                "9674199380",
        "9639840480\n" +
                "9648492180",
        "YG20246720",
        "YG23249897\n" +
                "YG23249907"

    )
)

